src/Documents/Check.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>Check</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CashFlowData</xr:Item>
				<xr:Item>InformationRegister.SerialNumbers</xr:Item>
				<xr:Item>AccumulationRegister.ClassData</xr:Item>
				<xr:Item>AccumulationRegister.ProjectData</xr:Item>
				<xr:Item>AccountingRegister.GeneralJournal</xr:Item>
				<xr:Item>AccumulationRegister.BankReconciliation</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>BankAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Memo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTotalRC</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DontCreate</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTotal</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentMethod</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PaymentMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PhysicalCheckNum</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Project</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Projects</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Voided</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DwollaTrxID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CoinbaseTrxID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RemitAddress</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Addresses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AutoGenerated</Name>
					<Comment>If generated automatically (e.g. in Cloud Banking)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>gh_date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>gh_descr</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>gh_bnkdesc</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>LineItems</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Account</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Memo</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Class</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Classes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Project</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Projects</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/InvoicePayment.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>InvoicePayment</Name>
			<BasedOn>
				<xr:Item>Document.PurchaseInvoice</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CashFlowData</xr:Item>
				<xr:Item>AccountingRegister.GeneralJournal</xr:Item>
				<xr:Item>AccumulationRegister.BankReconciliation</xr:Item>
				<xr:Item>AccumulationRegister.OrderTransactions</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTotal</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Memo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTotalRC</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BankAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentMethod</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PaymentMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PhysicalCheckNum</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Voided</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DwollaTrxID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CoinbaseTrxID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RemitAddress</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Addresses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AutoGenerated</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>LineItems</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Document</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.SalesReturn</v8:Type>
								<v8:Type>cfg:DocumentRef.PurchaseInvoice</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Payment</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Balance</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BalanceFCY</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Currency</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Check</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CommonModules/CommonUseServerCall/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Base functionality subsystem.
//------------------------------------------------------------------------------
// Server interface procedures and functions of common use for working with:
// - saving/reading/deleting settings to/from storages.
//

////////////////////////////////////////////////////////////////////////////////
#Region PUBLIC_INTERFACE

// Set default value of setting defined for the passed user.
// Use common settings storage for saving of user settings.
//
// Parameters:
//  Setting   - String    - Setting name.
//  Value     - Arbitrary - Value of setting.
//  User      - String    - User defining setting (current user by default).
//
Procedure SetValueAsDefault(Setting, Value, User = Undefined) Export 

	// Get current setting value.
	CurrentValueByDefault = GetValueByDefault(Setting,, User);
	
	// Check value type and compare old and new value.
	If TypeOf(Value) <> TypeOf(CurrentValueByDefault)
	Or Value <> CurrentValueByDefault Then
		
		// Save new value of setting.
		CommonSettingsStorage.Save(Upper(Setting),, Value,, User);
		
	EndIf;

EndProcedure

// Get default value of setting defined for the passed user.
// Use common settings storage for saving of user settings.
//
// Parameters:
//  Setting   - String    - Setting name.
//  Default   - Arbitrary - Default (or empty) value of the same type as expected.
//                          or Undefined to skip value checking.
//  User      - String    - User for which setting was defined (current user by default).
//
// Returns:
//  Value     - Arbitrary - Value of setting.
//
Function GetValueByDefault(Setting, Default = Undefined, User = Undefined) Export
	
	// Get value from common storage.
	Value = CommonSettingsStorage.Load(Upper(Setting),,, User);
	
	// Check value is properly filled
	If  Default = Undefined Then
		// No value for compare provided: skip value checking.
		Return Value;
		
	ElsIf Value = Undefined                // No value defined for this setting.
	   Or TypeOf(Value) <> TypeOf(Default) // Value defined, but other type than expected.
	Then // Only default value defined.
		
		// Try to use the existing value in the database if only one defined.
		If CommonUse.IsReference(TypeOf(Default)) Then
			
			// Check presence of only one ref othis kind in database.
			OnlyOneRef = CommonUse.RefIfOnlyOne(TypeOf(Default));
			If OnlyOneRef <> Undefined Then
				
				// Save currently found value for the later use.
				CommonSettingsStorage.Save(Upper(Setting),, OnlyOneRef,, User);
				
				// Return set value.
				Return OnlyOneRef;
			EndIf;
		EndIf;
		
		// No proper value found.
		Return Default;
		
	// Both Value and Default are defined.
	ElsIf (Value <> Default) // This is not default (or empty) value (prevents empty search).
	  And (CommonUse.IsReference(TypeOf(Value)))   // This is value of reference type
	  And (Not CommonUse.RefExists(Value)) // And reference actually don't exist.
	Then // Value of proper type saved, but no more exists in the database.
		
		// Broken link found.
		CommonSettingsStorage.Delete(Upper(Setting),, User);
		
		// Try to get value once again.
		Return GetValueByDefault(Setting, Default, User);
		
	Else
		// Value of proper type.
		Return Value;
	EndIf;
	
EndFunction

Function CheckNumberAllowed(Num, Ref, BankAccount) Export
	
	Try
		CheckNum = Number(Num);
	Except
		Return New Structure("DuplicatesFound, Allow", False, True);
	EndTry;
	
	If (CheckNum < 100) Or (CheckNum > 99999999) Then
		Return New Structure("DuplicatesFound, Allow", False, True);
	EndIf;

	Query = New Query("SELECT TOP 1
	                  |	ChecksWithNumber.Number,
	                  |	ChecksWithNumber.Ref,
	                  |	AllowDuplicateCheckNumbers.Value AS AllowDuplicateCheckNumbers
	                  |FROM
	                  |	(SELECT
	                  |		Check.PhysicalCheckNum AS Number,
	                  |		Check.Ref AS Ref
	                  |	FROM
	                  |		Document.Check AS Check
	                  |	WHERE
	                  |		Check.BankAccount = &BankAccount
	                  |		AND Check.PaymentMethod = VALUE(Catalog.PaymentMethods.Check)
	                  |		AND Check.PhysicalCheckNum = &CheckNum
	                  |	
	                  |	UNION ALL
	                  |	
	                  |	SELECT
	                  |		InvoicePayment.PhysicalCheckNum,
	                  |		InvoicePayment.Ref
	                  |	FROM
	                  |		Document.InvoicePayment AS InvoicePayment
	                  |	WHERE
	                  |		InvoicePayment.BankAccount = &BankAccount
	                  |		AND InvoicePayment.PaymentMethod = VALUE(Catalog.PaymentMethods.Check)
	                  |		AND InvoicePayment.PhysicalCheckNum = &CheckNum) AS ChecksWithNumber,
	                  |	Constant.AllowDuplicateCheckNumbers AS AllowDuplicateCheckNumbers
	                  |WHERE
	                  |	ChecksWithNumber.Ref <> &CurrentRef");
	Query.SetParameter("BankAccount", BankAccount);
	Query.SetParameter("CheckNum", CheckNum);
	Query.SetParameter("CurrentRef", Ref);
	QueryResult = Query.Execute();
	If QueryResult.IsEmpty() Then
		Return New Structure("DuplicatesFound, Allow", False, True);
	Else	
		Res = QueryResult.Select();
		Res.Next();
		Return New Structure("DuplicatesFound, Allow", True, Res.AllowDuplicateCheckNumbers);
	EndIf;		
	
EndFunction

#EndRegion
